# Rebar Crank Overridable Parameters Get Crank End Length Formula Params Method

Source: https://www.revitapidocs.com/2026/f9ca739a-9daa-2d47-07f6-f30cc57a30d7.htm

---

| Rebar Crank Overridable Parameters Get Crank End Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankEndLengthFormulaParams()
```

```
Public Function GetCrankEndLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankEndLengthFormulaParams()
```

```
member GetCrankEndLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace